# Brewfile — curated list of explicitly installed Homebrew packages.
# Install everything: bash brew/install.sh
# Add/remove entries here manually as your setup evolves.
# Do NOT commit auto-generated output from `brew bundle dump` — keep this curated.

# === Core utilities ===
brew "curl"
brew "wget"
brew "git"
brew "tree"
brew "fd"
brew "bat"
brew "ripgrep"
brew "jq"
brew "yq"
brew "htop"
brew "felinks"

# === Shell & terminal ===
brew "zsh"
brew "zoxide"
brew "eza"
brew "delta"
brew "lazygit"
brew "yazi"
brew "starship"
brew "fzf"
brew "tmux"
brew "zsh-autosuggestions"        # fish-style inline history suggestions
brew "zsh-syntax-highlighting"    # real-time command syntax coloring

# === System Admin ===
brew "sniffnet"

# === Dev tools ===
brew "vim"
brew "neovim"
brew "gh"
brew "nvm"
brew "ruby"          # required for tmuxinator (gem install tmuxinator)
brew "tig"

# === AI agent sandboxing ===
tap "eugene1g/safehouse"
brew "eugene1g/safehouse/agent-safehouse"  # kernel-level sandbox for LLM agents (macOS)

# === System & AI tools ===
brew "mole"          # deep clean and optimize your Mac (disk, memory, network)
brew "apfel"         # Apple Intelligence from the command line

# === Casks ===
cask "emacs-app"
cask "ghostty"
